===============================================================================
Paragraph: simple
===============================================================================
Line
-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: empty line
===============================================================================
Line

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: multiline
===============================================================================
Line1
Line2
Line3
-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: with words
===============================================================================
Multiple words in paragraph

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: two
===============================================================================
First

Second
-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Paragraph: two multiline
===============================================================================
In
First

In
Second
-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Heading 1
===============================================================================
# Heading

-------------------------------------------------------------------------------
(document (heading1 (marker)))
===============================================================================
Heading 2
===============================================================================
## Heading

-------------------------------------------------------------------------------
(document
  (heading2 (marker)))
===============================================================================
Heading 3
===============================================================================
### Heading

-------------------------------------------------------------------------------
(document
  (heading3 (marker)))
===============================================================================
Heading 4
===============================================================================
#### Heading

-------------------------------------------------------------------------------
(document
  (heading4 (marker)))
===============================================================================
Heading 5
===============================================================================
##### Heading

-------------------------------------------------------------------------------
(document
  (heading5 (marker)))
===============================================================================
Heading 6
===============================================================================
###### Heading

-------------------------------------------------------------------------------
(document
  (heading6 (marker)))

===============================================================================
Heading: multiple lines
===============================================================================
# Heading
# with
# lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading1
    (marker)
    (marker)
    (marker))
  (paragraph))

===============================================================================
Heading: multiple lines no # prefix
===============================================================================
# Heading
with
lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading1 (marker) (marker) (marker))
  (paragraph))

===============================================================================
Heading 2: multiple lines
===============================================================================
## Heading
with
lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading2 (marker) (marker) (marker))
  (paragraph))

===============================================================================
Heading 4: div closes
===============================================================================
:::
#### Heading
:::

stop

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (heading4 (marker))
    (div_marker_end))
  (paragraph))

===============================================================================
Heading 6: list closes
===============================================================================
###### Heading
- a

-------------------------------------------------------------------------------

(document
  (heading6 (marker))
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
Heading: followed by list
===============================================================================
# Heading

- a

-------------------------------------------------------------------------------

(document
  (heading1 (marker))
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
Block quote: oneline
===============================================================================
> This is a block quote.
-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (paragraph)))

===============================================================================
Block quote: long
===============================================================================
> This is a block quote.
>
> This is included

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (paragraph)
    (block_quote_marker)
    (paragraph
      (block_quote_marker))))

===============================================================================
Block quote: lazy
===============================================================================
> This is a block quote.
This is included

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (paragraph)))

===============================================================================
Block quote: multilevel close nesting
===============================================================================
> > > a
> b

c

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (block_quote
      (block_quote_marker)
      (block_quote
        (block_quote_marker)
        (paragraph)))
    (block_quote_marker)
    (paragraph))
  (paragraph))

===============================================================================
Block quote: multilevel nesting with space
===============================================================================
> > a
>
> b

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (block_quote
      (block_quote_marker)
      (paragraph))
    (block_quote_marker)
    (paragraph
      (block_quote_marker))))

===============================================================================
Block quote: contain code block
===============================================================================
> ``` lang
> code

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (code_block
      (code_block_marker_begin)
      (language)
      (code
        (block_quote_marker)))))

===============================================================================
Code block: without langugae
===============================================================================
```
Some text
here
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))

===============================================================================
Code block :lang
===============================================================================
``` rust   
Some text
here
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (language)
    (code)
    (code_block_marker_end)))

===============================================================================
Code block: 4 ` escapes 3
===============================================================================
````
x
```
y
````

===============================================================================
Code block: 3 ` escapes 4
===============================================================================
```
x
````
y
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))

===============================================================================
Raw block
===============================================================================
``` =html
<p>txt</p>
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (raw_block_marker_begin)
    (raw_block_info
      (language_marker)
      (language))
    (content)
    (raw_block_marker_end)))

===============================================================================
Thematic break: star
===============================================================================
Before

   *    *    *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: star more
===============================================================================
Before

   *    *    *  * *    * *    *

After

===============================================================================
Thematic break: then paragraph
===============================================================================
***
After

-------------------------------------------------------------------------------

(document
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus
===============================================================================
Before

 - - -

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: star 2 + 1
===============================================================================
Before

** * *****

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))


===============================================================================
Thematic break: star 1 + 2
===============================================================================
Before

** *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus 3 combined
===============================================================================
Before

---

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus 2 + 1
===============================================================================
Before

-- - --

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))


===============================================================================
Thematic break: minus 1 + 2
===============================================================================
Before

- -- - --

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))


===============================================================================
Link: ref def
===============================================================================
[ref]: /url

-------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label)
    (link_destination)))


===============================================================================
Link: ref def middle
===============================================================================
Some text

[ref]: /url

More text

===============================================================================
Link: ref defs
===============================================================================
Some text

[ref1]: /url
[ref1]: /url
[ref1]: /url

-------------------------------------------------------------------------------

(document
  (paragraph)
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination)))


===============================================================================
Block attribute: class
===============================================================================
{.bar}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (class))
  (paragraph))

===============================================================================
Block attribute: identifier
===============================================================================
{#id}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (identifier))
  (paragraph))

===============================================================================
Block attribute: key value
===============================================================================
{author=value}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: key value spaces
===============================================================================
{author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: mixed
===============================================================================
{.one .two #id author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (class)
    (class)
    (identifier)
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: comment
===============================================================================
{% some text here %}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (comment))
  (paragraph))

===============================================================================
Inline attribute: mixed
===============================================================================
text{.one .two #id author="with spaces"}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (class)
      (class)
      (identifier)
      (key_value
        (key)
        (value)))))

===============================================================================
Inline attribute: with newlines
===============================================================================
text{.one
.two
#three}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (class)
      (class)
      (identifier))))

===============================================================================
Inline attribute: comment
===============================================================================
text{%
some text here
%}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (comment))))

===============================================================================
Span
===============================================================================
One [two three]{.class
#id}

-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (inline_attribute
        (class)
        (identifier)))))

===============================================================================
Autolink
===============================================================================
With </url> link

-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)))

===============================================================================
Emphasis
===============================================================================
With _emphasis_ here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Strong
===============================================================================
With *emphasis* here

-------------------------------------------------------------------------------

(document
  (paragraph
    (strong)))

===============================================================================
Emphasis and strong
===============================================================================
With _*strong* emphasis_ here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (strong))))

===============================================================================
Emphasis: nested
===============================================================================
With __nested_ emphasis_

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Emphasis: forced despite spaces
===============================================================================
{_yes_}

{_ yes _}

_yes _}

{_ yes_}

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis))
  (paragraph (emphasis))
  (paragraph (emphasis))
  (paragraph (emphasis)))

===============================================================================
Strong: forced despite spaces
===============================================================================
{*yes*}

*yes *}

{* yes*}

{* yes *}

-------------------------------------------------------------------------------

(document
  (paragraph (strong))
  (paragraph (strong))
  (paragraph (strong))
  (paragraph (strong)))

===============================================================================
Subscript
===============================================================================
~sub~

{~many sub~}

-------------------------------------------------------------------------------

(document
  (paragraph (subscript))
  (paragraph (subscript)))

===============================================================================
Superscript
===============================================================================
^sup^

{^many sup^}

-------------------------------------------------------------------------------

(document
  (paragraph (superscript))
  (paragraph (superscript)))

===============================================================================
Highlighted
===============================================================================
With {=mark=} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (highlighted)))

===============================================================================
Insert
===============================================================================
With {+insert+} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (insert)))

===============================================================================
Delete
===============================================================================
With {-delete-} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (delete)))

===============================================================================
Hard line break
===============================================================================
With \
break

-------------------------------------------------------------------------------

(document
  (paragraph
    (hard_line_break)))

===============================================================================
Symbol
===============================================================================
With :wink: here

-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Link: inline
===============================================================================
With [link](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_link
      (link_text)
      (inline_link_destination))))

===============================================================================
Link: collapsed reference link
===============================================================================
With [a reference][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_link
      (link_text))))

===============================================================================
Link: full reference single
===============================================================================
With [a reference][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label))))


===============================================================================
Link: full reference
===============================================================================
With [a reference][ref]

[ref]: /url

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label)))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Image: inline
===============================================================================
![descr](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_image
      (image_description)
      (inline_link_destination))))

===============================================================================
Image: collapsed reference link
===============================================================================
![img][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_image
      (image_description))))

===============================================================================
Image: full reference
===============================================================================
![descr][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_image
      (image_description)
      (link_label))))


===============================================================================
Div: simple
===============================================================================
:::
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (paragraph)
    (div_marker_end)))

===============================================================================
Div: class
===============================================================================
::: myclass
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin
      (class_name))
    (paragraph)
    (div_marker_end)))

===============================================================================
Div: end paragraph inside
===============================================================================
:::
Inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (paragraph)
    (div_marker_end)))


===============================================================================
Div: eof closes
===============================================================================
:::
Inside

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (paragraph)))

===============================================================================
Div: nested
===============================================================================
:::
1

::::
2
::::

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (paragraph)
    (div
      (div_marker_begin)
      (paragraph)
      (div_marker_end))
    (paragraph)
    (div_marker_end)))

===============================================================================
Div: close nested div
===============================================================================
:::
1

::::
2

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (paragraph)
    (div
      (div_marker_begin)
      (paragraph))
    (div_marker_end)))

===============================================================================
Footnote: reference
===============================================================================

Here's a ref.[^foo]

-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference
      (reference_label))))

===============================================================================
Smart punctuation
===============================================================================

Ellipsis...

Em---dash
Eh--dash

Some{"quotes"} be{'here'}yo

 \"Straight\" \'quotes\'

-------------------------------------------------------------------------------

(document
  (paragraph
    (ellipsis))
  (paragraph
    (em_dash)
    (en_dash))
  (paragraph
    (escaped_quote)
    (escaped_quote))
  (paragraph
    (escaped_quote)
    (escaped_quote)
    (escaped_quote)
    (escaped_quote)))

===============================================================================
Paragraph: not recognized
===============================================================================
Before

--

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph (en_dash))
  (paragraph))

===============================================================================
Paragraph :not recognized 2
===============================================================================
Before

-

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Verbatim: single
===============================================================================
Simple `verbatim` here

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))))

===============================================================================
Verbatim: double with single inside
===============================================================================
``verbatim with a backtick ` characters``

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))))

===============================================================================
Verbatim: with triple inside
===============================================================================
`verbatim with three backtick ``` characters`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))))

===============================================================================
Verbatim: newline closes
===============================================================================
`verbatim

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))))


===============================================================================
Verbatim: multiple
===============================================================================
`x` `y`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))
    (verbatim
      (verbatim_marker_begin)
      (verbatim_marker_end))))

===============================================================================
Raw inline
===============================================================================
`<? php echo 'yoyo' ?>`{=html}

-------------------------------------------------------------------------------

(document
  (paragraph
    (raw_inline
      (raw_inline_marker_begin)
      (raw_inline_marker_end)
      (raw_inline_attribute
        (language)))))

===============================================================================
Math
===============================================================================
$`1 + 2`

-------------------------------------------------------------------------------

(document
  (paragraph
    (math
      (math_marker)
      (math_marker_begin)
      (math_marker_end))))

===============================================================================
List: single dash
===============================================================================
- Item

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: tight dashes
===============================================================================
- a
- b
- c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: multiple lists with space between
===============================================================================
- a
- b

- x
- y

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: multiple lists with paragraph between
===============================================================================
- a
- b

paragraph

- x
- y

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph)))
  (paragraph)
  (list
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: Contain unindented paragraph closes list
===============================================================================
- First

Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph)))
  (paragraph))

===============================================================================
List: Continue paragraph with soft break
===============================================================================
- First
 Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: Continue paragraph with lazy indentation
===============================================================================
- First
Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
List: Contain multiple paragraphs
===============================================================================
- First

  Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph)
      (paragraph))))

===============================================================================
List: Immediate blockquote
===============================================================================
- > a
  > b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (block_quote
        (block_quote_marker)
        (paragraph
          (block_quote_marker))))))

===============================================================================
List: Close contained code block at eof
===============================================================================
- ```
  b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (code_block
        (code_block_marker_begin)
        (code)))))

===============================================================================
List: Close contained code at next non-indent
===============================================================================
- ```
  a

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (code_block
        (code_block_marker_begin)
        (code))))
  (paragraph))

===============================================================================
List: Close contained multiline code at next non-indent
===============================================================================
- ```
  a

  b

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (code_block
        (code_block_marker_begin)
        (code))))
  (paragraph))

===============================================================================
List: Close contained div at eof
===============================================================================
- ::: mydiv
  a

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (div
        (div_marker_begin
          (class_name))
        (paragraph)))))

===============================================================================
List: Close contained div at next non-indent
===============================================================================
- ::: mydiv
  a

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (div
        (div_marker_begin
          (class_name))
        (paragraph))))
  (paragraph))

===============================================================================
List: With sublist
===============================================================================
- one
- two

  - sub
  - sub

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))
    (list_item
      (list_marker_dash)
      (paragraph)
      (list
        (list_item
          (list_marker_dash)
          (paragraph))
        (list_item
          (list_marker_dash)
          (paragraph))))))

===============================================================================
List: plus
===============================================================================
+ one
+ two

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_plus)
      (paragraph))
    (list_item
      (list_marker_plus)
      (paragraph))))

===============================================================================
List: star
===============================================================================
* one
* two

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_star)
      (paragraph))
    (list_item
      (list_marker_star)
      (paragraph))))

===============================================================================
List: mixed bullets create new lists
===============================================================================
- one
+ two
* tree

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph)))
  (list
    (list_item
      (list_marker_plus)
      (paragraph)))
  (list
    (list_item
      (list_marker_star)
      (paragraph))))

===============================================================================
List: close sublist
===============================================================================
+ one

  + sub

  inner

outer

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_plus)
      (paragraph)
      (list
        (list_item
          (list_marker_plus)
          (paragraph)))
    (paragraph)))
  (paragraph))

===============================================================================
List: definition
===============================================================================
: term

  Def

  More def

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_definition)
      (term)
      (definition
        (paragraph)
        (paragraph)))))

===============================================================================
List: ordered list markers
===============================================================================
1.
1.

1)
1)

(1)
(1)

a.
a.

a)
a)

(a)
(a)

A.
A.

A)
A)

(A)
(A)

i.
i.

i)
i)

(i)
(i)

I.
I.

I)
I)

(I)
(I)


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (paragraph))
    (list_item
      (list_marker_decimal_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_decimal_paren)
      (paragraph))
    (list_item
      (list_marker_decimal_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_decimal_parens)
      (paragraph))
    (list_item
      (list_marker_decimal_parens)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_alpha_period)
      (paragraph))
    (list_item
      (list_marker_lower_alpha_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_alpha_paren)
      (paragraph))
    (list_item
      (list_marker_lower_alpha_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_alpha_parens)
      (paragraph))
    (list_item
      (list_marker_lower_alpha_parens)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_alpha_period)
      (paragraph))
    (list_item
      (list_marker_upper_alpha_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_alpha_paren)
      (paragraph))
    (list_item
      (list_marker_upper_alpha_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_alpha_parens)
      (paragraph))
    (list_item
      (list_marker_upper_alpha_parens)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_roman_period)
      (paragraph))
    (list_item
      (list_marker_lower_roman_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_roman_paren)
      (paragraph))
    (list_item
      (list_marker_lower_roman_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_roman_parens)
      (paragraph))
    (list_item
      (list_marker_lower_roman_parens)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_roman_period)
      (paragraph))
    (list_item
      (list_marker_upper_roman_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_roman_paren)
      (paragraph))
    (list_item
      (list_marker_upper_roman_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_upper_roman_parens)
      (paragraph))
    (list_item
      (list_marker_upper_roman_parens)
      (paragraph))))

===============================================================================
List: close decimal sublist
===============================================================================
1. one

  1. sub

  inner

outer

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (paragraph)
      (list
        (list_item
          (list_marker_decimal_period)
          (paragraph)))
    (paragraph)))
  (paragraph))

===============================================================================
List: ordered list don't mix
===============================================================================
1.
1)
i)
(a)

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (paragraph)))
  (list
    (list_item
      (list_marker_decimal_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_roman_paren)
      (paragraph)))
  (list
    (list_item
      (list_marker_lower_alpha_parens)
      (paragraph))))

===============================================================================
List: task
===============================================================================
- [ ] a
- [x] b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (paragraph))
    (list_item
      (list_marker_task
        (checked))
      (paragraph))))

===============================================================================
List: task mix multiple styles
===============================================================================
* [ ] a
+ [ ] b
- [ ] c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (paragraph))
    (list_item
      (list_marker_task
        (unchecked))
      (paragraph))
    (list_item
      (list_marker_task
        (unchecked))
      (paragraph))))

===============================================================================
List: double dash
===============================================================================
- -

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (paragraph))))

===============================================================================
Table: single row
===============================================================================
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: initial separator
===============================================================================
|---|---|
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: separator + header
===============================================================================
| x|y|
|--|--:|
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: separator alignments
===============================================================================
|----|---:|:---|:--:|
| a | b | c | d |

-------------------------------------------------------------------------------

(document
  (table
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment)
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell)
      (table_cell)
      (table_cell))))

===============================================================================
Table: multiple headers
===============================================================================
|1|2|
|-|-|
|3|4|
|-|-|
|a|b|

-------------------------------------------------------------------------------

(document
  (table
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: inside blockquote
===============================================================================
> | x|y|
> |--|--:|
> | a | b |

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (table
      (table_header
        (table_cell)
        (table_cell))
      (table_separator
        (block_quote_marker)
        (table_cell_alignment)
        (table_cell_alignment))
      (table_row
        (block_quote_marker)
        (table_cell)
        (table_cell)))))

===============================================================================
Table: with inline styling
===============================================================================
| _x_ | *y* |

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell (emphasis))
      (table_cell (strong)))))

===============================================================================
Table: with caption
===============================================================================
| x | y |
^ caption _here_

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))
    (table_caption
      (marker)
      (emphasis))))

===============================================================================
Table: with spaced caption
===============================================================================
| x | y |

^ extra blank
  with indent

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))
    (table_caption
      (marker))))

===============================================================================
Footnote: simple
===============================================================================
[^x]: a

-------------------------------------------------------------------------------

(document
  (footnote
    (reference_label)
    (paragraph)))

===============================================================================
Footnote: multiline
===============================================================================
[^foo]: Text
that continues

  Next paragraph

-------------------------------------------------------------------------------

(document
  (footnote
    (reference_label)
    (paragraph)
    (paragraph)))

===============================================================================
Footnote: With block quote
===============================================================================
[^foo]: Text

  > block quote inside

-------------------------------------------------------------------------------

(document
  (footnote
    (reference_label)
    (paragraph)
    (block_quote
      (block_quote_marker)
      (paragraph))))

===============================================================================
Paragraph: broken things
===============================================================================
1 * 2

2 _ 1

1 ^ 2

~ x

{*x

{=x

{-x

^x

{^x

:x

_ x _

_x _

_ x_

x * x *

x *x *

x * x*

- [

[x

[^x]

^

|

`

:

-

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))
