===============================================================================
Paragraph simple
===============================================================================
Line
-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph empty line
===============================================================================
Line

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph multiline
===============================================================================
Line1
Line2
Line3
-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph with words
===============================================================================
Multiple words in paragraph

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Two paragraphs
===============================================================================
First

Second
-------------------------------------------------------------------------------

(document
  (paragraph
   )
  (paragraph
   ))

===============================================================================
Paragraph two multiline
===============================================================================
In
First

In
Second
-------------------------------------------------------------------------------

(document
  (paragraph
   )
  (paragraph
   ))

===============================================================================
Heading 1
===============================================================================
# Heading
-------------------------------------------------------------------------------
(document (heading1))
===============================================================================
Heading 2
===============================================================================
## Heading
-------------------------------------------------------------------------------
(document
  (heading2))
===============================================================================
Heading 3
===============================================================================
### Heading
-------------------------------------------------------------------------------
(document
  (heading3))
===============================================================================
Heading 4
===============================================================================
#### Heading
-------------------------------------------------------------------------------
(document
  (heading4))
===============================================================================
Heading 5
===============================================================================
##### Heading
-------------------------------------------------------------------------------
(document
  (heading5))
===============================================================================
Heading 6
===============================================================================
###### Heading
-------------------------------------------------------------------------------
(document
  (heading6))

===============================================================================
Heading multiple lines
===============================================================================
# Heading
# with
# lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading1)
  (paragraph))

===============================================================================
Heading multiple lines no # prefix
===============================================================================
# Heading
with
lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading1)
  (paragraph))

===============================================================================
Heading 2 multiple lines
===============================================================================
## Heading
with
lines

A paragraph
-------------------------------------------------------------------------------

(document
  (heading2)
  (paragraph))

===============================================================================
Block quote
===============================================================================
> This is a block quote.
-------------------------------------------------------------------------------

(document
  (blockquote))

===============================================================================
Block quote long
===============================================================================
> This is a block quote.
>
> This is included

-------------------------------------------------------------------------------

(document
  (blockquote))

===============================================================================
Block quote lazy
===============================================================================
> This is a block quote.
This is included

-------------------------------------------------------------------------------

(document
  (blockquote))

===============================================================================
Code block raw
===============================================================================
```
Some text
here
```

-------------------------------------------------------------------------------

(document
  (codeblock
    (code
      (line)
      (line))))

===============================================================================
Code block lang
===============================================================================
``` rust
Some text
here
```

-------------------------------------------------------------------------------

(document
  (codeblock
    (language)
    (code
      (line)
      (line))))

===============================================================================
Thematic break star
===============================================================================
Before

   *    *    *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))

===============================================================================
Thematic break star more
===============================================================================
Before

   *    *    *  * *    * *    *

After

===============================================================================
Thematic break then paragraph
===============================================================================
***
After

-------------------------------------------------------------------------------

(document
  (thematicbreak)
  (paragraph))

===============================================================================
Thematic break minus
===============================================================================
Before

 - - -

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))

===============================================================================
Thematic break star 2 + 1
===============================================================================
Before

** * *****

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))


===============================================================================
Thematic break star 1 + 2
===============================================================================
Before

** *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))

===============================================================================
Thematic break minus 3 combined
===============================================================================
Before

---

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))

===============================================================================
Thematic break minus 2 + 1
===============================================================================
Before

-- - --

Aft.dynamicer

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))


===============================================================================
Thematic break minus 1 + 2
===============================================================================
Before

- -- - --

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematicbreak)
  (paragraph))


===============================================================================
Link ref def
===============================================================================
[ref]: /url

-------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label)
    (link_destination)))


===============================================================================
Link ref def middle
===============================================================================
Some text

[ref]: /url

More text

===============================================================================
Link ref defs
===============================================================================
Some text

[ref1]: /url
[ref1]: /url
[ref1]: /url

-------------------------------------------------------------------------------

(document
  (paragraph)
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination)))


===============================================================================
Block attribute: class
===============================================================================
{.bar}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (class))
  (paragraph))

===============================================================================
Block attribute: identifier
===============================================================================
{#id}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (identifier))
  (paragraph))

===============================================================================
Block attribute: key value
===============================================================================
{author=value}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: key value spaces
===============================================================================
{author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: mixed
===============================================================================
{.one .two #id author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (class)
    (class)
    (identifier)
    (key_value
      (key)
      (value)))
  (paragraph))

===============================================================================
Block attribute: comment
===============================================================================
{% some text here %}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (comment))
  (paragraph))

===============================================================================
Inline attribute: mixed
===============================================================================
text{.one .two #id author="with spaces"}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (class)
      (class)
      (identifier)
      (key_value
        (key)
        (value)))))

===============================================================================
Inline attribute: with newlines
===============================================================================
text{.one
.two
#three}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (class)
      (class)
      (identifier))))

===============================================================================
Inline attribute: comment
===============================================================================
text{%
some text here
%}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (comment))))

===============================================================================
Span
===============================================================================
One [two three]{.class
#id}

-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (inline_attribute
        (class)
        (identifier)))))

===============================================================================
Autolink
===============================================================================
With </url> link

-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)))

===============================================================================
Emphasis
===============================================================================
With _emphasis_ here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis)))

===============================================================================
Strong
===============================================================================
With *emphasis* here

-------------------------------------------------------------------------------

(document
  (paragraph
    (strong)))

===============================================================================
Emphasis and strong
===============================================================================
With _*strong* emphasis_ here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (strong))))

===============================================================================
Emphasis nested
===============================================================================
With __nested_ emphasis_

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis))))

===============================================================================
Emphasis no spaces
===============================================================================
_ no _

_no _

_ no_

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Emphasis forced despite spaces
===============================================================================
{_yes_}

{_ yes _}

_yes _}

{_ yes_}

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis))
  (paragraph (emphasis))
  (paragraph (emphasis))
  (paragraph (emphasis)))

===============================================================================
Strong no spaces
===============================================================================
_ no _

_no _

_ no_

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Strong forced despite spaces
===============================================================================
{*yes*}

*yes *}

{* yes*}

{* yes *}

-------------------------------------------------------------------------------

(document
  (paragraph (strong))
  (paragraph (strong))
  (paragraph (strong))
  (paragraph (strong)))

===============================================================================
Subscript
===============================================================================
~sub~

{~many sub~}

-------------------------------------------------------------------------------

(document
  (paragraph (subscript))
  (paragraph (subscript)))

===============================================================================
Superscript
===============================================================================
^sup^

{^many sup^}

-------------------------------------------------------------------------------

(document
  (paragraph (superscript))
  (paragraph (superscript)))

===============================================================================
Regular paragraphs, broken emphasis and strong
===============================================================================
1 * 2

2 _ 1

* 1

1 ^ 2

~ x

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Highlighted
===============================================================================
With {=mark=} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (highlighted)))

===============================================================================
Insert
===============================================================================
With {+insert+} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (insert)))

===============================================================================
Delete
===============================================================================
With {-delete-} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (delete)))

===============================================================================
Hard line break
===============================================================================
With \
break

-------------------------------------------------------------------------------

(document
  (paragraph
    (hard_line_break)))

===============================================================================
Symbol
===============================================================================
With :wink: here

-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Link inline
===============================================================================
With [link](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_link
      (link_text)
      (inline_link_destination))))

===============================================================================
Link collapsed reference link
===============================================================================
With [a reference][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_link
      (link_text))))

===============================================================================
Link full reference single
===============================================================================
With [a reference][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label))))


===============================================================================
Link full reference
===============================================================================
With [a reference][ref]

[ref]: /url

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label)))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Image inline
===============================================================================
![descr](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_image
      (image_description)
      (inline_link_destination))))

===============================================================================
Image collapsed reference link
===============================================================================
![img][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_image
      (image_description))))

===============================================================================
Image full reference
===============================================================================
![descr][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_image
      (image_description)
      (link_label))))


===============================================================================
Div simple
===============================================================================
:::
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start)
    (paragraph)
    (div_marker_end)))

===============================================================================
Div class
===============================================================================
::: myclass
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start
      (class_name))
    (paragraph)
    (div_marker_end)))

===============================================================================
Div end paragraph inside
===============================================================================
:::
Inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start)
    (paragraph)
    (div_marker_end)))


===============================================================================
Div eof closes
===============================================================================
:::
Inside

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start)
    (paragraph)))

===============================================================================
Div nested
===============================================================================
:::
1

::::
2
::::

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start)
    (paragraph)
    (div
      (div_marker_start)
      (paragraph)
      (div_marker_end))
    (paragraph)
    (div_marker_end)))

===============================================================================
Div close nested div
===============================================================================
:::
1

::::
2

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_start)
    (paragraph)
    (div
      (div_marker_start)
      (paragraph))
    (div_marker_end)))

===============================================================================
Footnote reference
===============================================================================

Here's a ref.[^foo]

-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference
      (reference_label))))

===============================================================================
Smart punctuation
===============================================================================

Ellipsis...

Em---dash
Eh--dash

Some{"quotes"} be{'here'}yo

 \"Straight\" \'quotes\'

-------------------------------------------------------------------------------

(document
  (paragraph
    (ellipsis))
  (paragraph
    (em_dash)
    (en_dash))
  (paragraph
    (escaped_quote)
    (escaped_quote))
  (paragraph
    (escaped_quote)
    (escaped_quote)
    (escaped_quote)
    (escaped_quote)))

===============================================================================
Paragraph not recognized
===============================================================================
Before

--

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph (en_dash))
  (paragraph))

===============================================================================
Paragraph not recognized 2
===============================================================================
Before

-

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Verbatim single
===============================================================================
Simple `verbatim` here

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))))

===============================================================================
Verbatim double with single inside
===============================================================================
``verbatim with a backtick ` characters``

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))))

===============================================================================
Verbatim with triple inside
===============================================================================
`verbatim with three backtick ``` characters`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))))

===============================================================================
Verbatim newline closes
===============================================================================
`verbatim

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))))


===============================================================================
Verbatim multiple
===============================================================================
`x` `y`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))
    (verbatim
      (verbatim_marker_start)
      (verbatim_marker_end))))

===============================================================================
Raw inline
===============================================================================
`<? php echo 'yoyo' ?>`{=html}

-------------------------------------------------------------------------------

(document
  (paragraph
    (raw_inline
      (raw_inline_marker_start)
      (raw_inline_marker_end)
      (raw_inline_attribute
        (language)))))

===============================================================================
Math
===============================================================================
$`1 + 2`

-------------------------------------------------------------------------------

(document
  (paragraph
    (math
      (math_marker)
      (math_marker_start)
      (math_marker_end))))

